Revit 2027 API
MassInstanceUtils.GetJoinedElementIds Method
 Get the ElementIds of Elements that are joined to a mass instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ElementId> GetJoinedElementIds(
	Document document,
	ElementId massInstanceId
)
Public Shared Function GetJoinedElementIds (
	document As Document,
	massInstanceId As ElementId
) As IList(Of ElementId)
public:
static IList<ElementId^>^ GetJoinedElementIds(
	Document^ document,
	ElementId^ massInstanceId
)
static member GetJoinedElementIds :
        document : Document *
        massInstanceId : ElementId -> IList<ElementId>
Parameters
document Document
 The Document.
massInstanceId ElementId
 The ElementId of the mass instance.
Return Value
IList<ElementId>
 ElementIds of Elements joined to the mass instance.
Exceptions
Exception | Condition
ArgumentException |  The ElementId massInstanceId is not a mass instance.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MassInstanceUtils Class
Autodesk.Revit.DB Namespace